In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt 
import seaborn as sns

In [3]:
data = pd.read_csv(r"C:\Users\Ankita\Desktop\attrition1.csv")
data

,Age,Attrition,BusinessTravel,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeID,Gender,...,NumCompaniesWorked,Over18,PercentSalaryHike,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany,YearsSinceLastPromotion,YearsWithCurrManager
0,51,No,Travel_Rarely,Sales,6,2,Life Sciences,1,1,Female,...,1.0,Y,11,8,0,1.0,6,1,0,0
1,31,Yes,Travel_Frequently,Research & Development,10,1,Life Sciences,1,2,Female,...,0.0,Y,23,8,1,6.0,3,5,1,4
2,32,No,Travel_Frequently,Research & Development,17,4,Other,1,3,Male,...,1.0,Y,15,8,3,5.0,2,5,0,3
3,38,No,Non-Travel,Research & Development,2,5,Life Sciences,1,4,Male,...,3.0,Y,11,8,3,13.0,5,8,7,5
4,32,No,Travel_Rarely,Research & Development,10,1,Medical,1,5,Male,...,4.0,Y,12,8,2,9.0,2,6,0,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4405,42,No,Travel_Rarely,Research & Development,5,4,Medical,1,4406,Female,...,3.0,Y,17,8,1,10.0,5,3,0,2
4406,29,No,Travel_Rarely,Research & Development,2,4,Medical,1,4407,Male,...,2.0,Y,15,8,0,10.0,2,3,0,2
4407,25,No,Travel_Rarely,Research & Development,25,2,Life Sciences,1,4408,Male,...,0.0,Y,20,8,0,5.0,4,4,1,2
4408,42,No,Travel_Rarely,Sales,18,2,Medical,1,4409,Male,...,0.0,Y,14,8,1,10.0,2,9,7,8
4409,40,No,Travel_Rarely,Research & Development,28,3,Medical,1,4410,Male,...,0.0,Y,12,8,0,NaN,6,21,3,9

In [4]:
grouped = data.groupby(data.Attrition)
data1 = grouped.get_group('Yes')
data1.head()

,Age,Attrition,BusinessTravel,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeID,Gender,...,NumCompaniesWorked,Over18,PercentSalaryHike,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany,YearsSinceLastPromotion,YearsWithCurrManager
1,31,Yes,Travel_Frequently,Research & Development,10,1,Life Sciences,1,2,Female,...,0.0,Y,23,8,1,6.0,3,5,1,4
6,28,Yes,Travel_Rarely,Research & Development,11,2,Medical,1,7,Male,...,2.0,Y,20,8,1,5.0,2,0,0,0
13,47,Yes,Non-Travel,Research & Development,1,1,Medical,1,14,Male,...,1.0,Y,11,8,2,10.0,4,10,9,9
28,44,Yes,Travel_Frequently,Research & Development,1,2,Medical,1,29,Male,...,3.0,Y,14,8,1,19.0,2,1,0,0
30,26,Yes,Travel_Rarely,Research & Development,4,3,Medical,1,31,Male,...,2.0,Y,11,8,0,5.0,5,3,0,2

In [5]:
grouped = data.groupby(data.Attrition)
data2 = grouped.get_group('No')
data2.head()

,Age,Attrition,BusinessTravel,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeID,Gender,...,NumCompaniesWorked,Over18,PercentSalaryHike,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany,YearsSinceLastPromotion,YearsWithCurrManager
0,51,No,Travel_Rarely,Sales,6,2,Life Sciences,1,1,Female,...,1.0,Y,11,8,0,1.0,6,1,0,0
2,32,No,Travel_Frequently,Research & Development,17,4,Other,1,3,Male,...,1.0,Y,15,8,3,5.0,2,5,0,3
3,38,No,Non-Travel,Research & Development,2,5,Life Sciences,1,4,Male,...,3.0,Y,11,8,3,13.0,5,8,7,5
4,32,No,Travel_Rarely,Research & Development,10,1,Medical,1,5,Male,...,4.0,Y,12,8,2,9.0,2,6,0,4
5,46,No,Travel_Rarely,Research & Development,8,3,Life Sciences,1,6,Female,...,3.0,Y,13,8,0,28.0,5,7,7,7

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4410 entries, 0 to 4409
Data columns (total 24 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Age                      4410 non-null   int64
 1   Attrition                4410 non-null   object
 2   BusinessTravel           4410 non-null   object
 3   Department               4410 non-null   object
 4   DistanceFromHome         4410 non-null   int64
 5   Education                4410 non-null   int64
 6   EducationField           4410 non-null   object
 7   EmployeeCount            4410 non-null   int64
 8   EmployeeID               4410 non-null   int64
 9   Gender                   4410 non-null   object
 10  JobLevel                 4410 non-null   int64
 11  JobRole                  4410 non-null   object
 12  MaritalStatus            4410 non-null   object
 13  MonthlyIncome            4410 non-null   int64
 14  NumCompaniesWorked       4391 non-null   float64
 15  Over18                   4410 non-null   object
 16  PercentSalaryHike        4410 non-null   int64
 17  StandardHours            4410 non-null   int64
 18  StockOptionLevel         4410 non-null   int64
 19  TotalWorkingYears        4401 non-null   float64
 20  TrainingTimesLastYear    4410 non-null   int64
 21  YearsAtCompany           4410 non-null   int64
 22  YearsSinceLastPromotion  4410 non-null   int64
 23  YearsWithCurrManager     4410 non-null   int64
dtypes: float64(2), int64(14), object(8)
memory usage: 827.0+ KB

## Mannwhitney test:

In [68]:
from scipy.stats import mannwhitneyu

In [69]:
stats,p=mannwhitneyu(data1.Age,data2.Age)
stats,p

(961731.0, 2.9951588479067175e-30)

In [67]:
stats,p=mannwhitneyu(data1.BusinessTravel,data2.BusinessTravel)
stats,p

(1266192.0, 0.024442388462694316)

In [72]:
stats,p=mannwhitneyu(data1.Department,data2.Department)
stats,p

(1243183.5, 0.0027584840572994446)

In [73]:
stats,p=mannwhitneyu(data1.DistanceFromHome,data2.DistanceFromHome)
stats,p

(1312110.0, 0.4629185205822659)

In [74]:
stats,p=mannwhitneyu(data1.Education,data2.Education)
stats,p

(1280146.5, 0.12035477215449608)

In [75]:
stats,p=mannwhitneyu(data1.EducationField,data2.EducationField)
stats,p

(1206328.5, 0.0001114613326946958)

In [77]:
stats,p=mannwhitneyu(data1.EmployeeID,data2.EmployeeID)
stats,p

(1305231.0, 0.37676085727599645)

In [78]:
stats,p=mannwhitneyu(data1.Gender,data2.Gender)
stats,p

(1283242.5, 0.11439304195948907)

In [79]:
stats,p=mannwhitneyu(data1.JobLevel,data2.JobLevel)
stats,p

(1309131.0, 0.4211326530832555)

In [80]:
stats,p=mannwhitneyu(data1.JobRole,data2.JobRole)
stats,p

(1271367.0, 0.07748676434031176)

In [82]:
stats,p=mannwhitneyu(data1.MaritalStatus,data2.MaritalStatus)
stats,p

(998784.0, 2.834595383665665e-28)

In [83]:
stats,p=mannwhitneyu(data1.MonthlyIncome,data2.MonthlyIncome)
stats,p

(1264900.5, 0.053577283839938566)

In [84]:
stats,p=mannwhitneyu(data1.NumCompaniesWorked,data2.NumCompaniesWorked)
stats,p

(1255531.5, 0.02488087998120482)

In [87]:
stats,p=mannwhitneyu(data1.PercentSalaryHike,data2.PercentSalaryHike)
stats,p

(1250640.0, 0.018660129917539733)

In [89]:
stats,p=mannwhitneyu(data1.StockOptionLevel,data2.StockOptionLevel)
stats,p

(1296846.0, 0.2636805975678432)

In [90]:
stats,p=mannwhitneyu(data1.TotalWorkingYears,data2.TotalWorkingYears)
stats,p

(909954.0, 2.8897554531400447e-39)

In [91]:
stats,p=mannwhitneyu(data1.TrainingTimesLastYear,data2.TrainingTimesLastYear)
stats,p

(1238940.0, 0.005167954938699059)

In [92]:
stats,p=mannwhitneyu(data1.YearsAtCompany,data2.YearsAtCompany)
stats,p

(923238.0, 6.047598261692858e-37)

In [93]:
stats,p=mannwhitneyu(data1.YearsSinceLastPromotion,data2.YearsSinceLastPromotion)
stats,p

(1209366.0, 0.0002021180346719736)

In [94]:
stats,p=mannwhitneyu(data1.YearsWithCurrManager,data2.YearsWithCurrManager)
stats,p

(957253.5, 1.2365483142169853e-31)

# RESULT:
## case1:

##### h0: there is no significant difference between attrition and Age ,BusinessTravel,Department,EducationField, MaritalStatus,NumCompaniesWorked,PercentSalaryHike,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany.
##### h1: there is significant difference between attrition and Age  ,BusinessTravel,Department,EducationField, MaritalStatus,NumCompaniesWorked,PercentSalaryHike,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany.
Here , p_value < 0.05 
#### Hence, h0 is rejected and h1 is accepted.
#### which means, there is significant difference between attrition and Age ,BusinessTravel,Department,EducationField, MaritalStatus,NumCompaniesWorked,PercentSalaryHike,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany.

## case2:

##### h0: there is no significant difference between attrition and distance from home,education,employee id,gender,joblevel,jobrole,monthlyincome,stockpointlevel.
##### h1: there is significant difference between attrition and distance from home,education,employee id,gender,joblevel,jobrole,monthlyincome,stockpointlevel.
Here , p_value > 0.05 
#### Hence, h0 is rejected and h1 is accepted.
#### which means, there is significant difference between attrition anddistance from home,education,employee id,gender,joblevel,jobrole,monthlyincome,stockpointlevel.

# Two sample independent t- test:

In [13]:
from scipy.stats import ttest_ind

In [16]:
stats,p = ttest_ind(data1.DistanceFromHome,data2.DistanceFromHome)
stats,p

(-0.6460416038042738, 0.518286042805572)

In [17]:
stats,p = ttest_ind(data1.Age,data2.Age)
stats,p

(-10.70661860061757, 1.9968016158894556e-26)

In [18]:
stats,p = ttest_ind(data1.Education,data2.Education)
stats,p

(-1.003386859630148, 0.3157293177122392)

In [20]:
stats,p = ttest_ind(data1.EmployeeID,data2.EmployeeID)
stats,p

(-0.3139830896533784, 0.7535487401894094)

In [21]:
stats,p = ttest_ind(data1.JobLevel,data2.JobLevel)
stats,p

(-0.6831987436544922, 0.4945171727187496)

In [22]:
stats,p = ttest_ind(data1.MonthlyIncome,data2.MonthlyIncome)
stats,p

(-2.0708863763619316, 0.03842748490605113)

In [25]:
stats,p = ttest_ind(data1.PercentSalaryHike,data2.PercentSalaryHike)
stats,p

(2.1610730224641777, 0.03074338643339195)

In [27]:
stats,p = ttest_ind(data1.StockOptionLevel,data2.StockOptionLevel)
stats,p

(-0.45406097771582266, 0.6498072937482536)

In [29]:
stats,p = ttest_ind(data1.TrainingTimesLastYear,data2.TrainingTimesLastYear)
stats,p

(-3.2858496615530743, 0.0010247061915374478)

In [30]:
stats,p = ttest_ind(data1.YearsAtCompany,data2.YearsAtCompany)
stats,p

(-9.004357011787226, 3.163883122491456e-19)

In [31]:
stats,p = ttest_ind(data1.YearsSinceLastPromotion,data2.YearsSinceLastPromotion)
stats,p

(-2.1934039604328843, 0.028330336189428353)

In [32]:
stats,p = ttest_ind(data1.YearsWithCurrManager,data2.YearsWithCurrManager)
stats,p

(-10.499379408703438, 1.7339322652918153e-25)

# RESULT:
## case1:

##### h0: there is no significant difference between attrition and Age,MonthlyIncome,PercentSalaryHike,TrainingTimesLastYear,YearsAtCompany,YearsSinceLastPromotion,YearsWithCurrManager.
##### h1: there is significant difference between attrition and Age,MonthlyIncome,PercentSalaryHike,TrainingTimesLastYear,YearsAtCompany,YearsSinceLastPromotion,YearsWithCurrManager.
Here , p_value < 0.05 
#### Hence, h0 is rejected and h1 is accepted.
#### which means, there is significant difference between attrition and Age,MonthlyIncome,PercentSalaryHike,TrainingTimesLastYear,YearsAtCompany,YearsSinceLastPromotion,YearsWithCurrManager.

## case2:

##### h0: there is no significant difference between attrition and dDistanceFromHome,Education,joblevel,StockOptionLevel.
##### h1: there is significant difference between attrition and DistanceFromHome,Education,joblevel,StockOptionLevel.
Here , p_value > 0.05 
#### Hence, h0 is rejected and h1 is accepted.
#### which means, there is significant difference between attrition and DistanceFromHome,Education,joblevel,StockOptionLevel.

# Chi square  test

In [34]:
from scipy.stats import chi2_contingency

In [36]:
chitable = pd.crosstab(data.Attrition,data.Age) 
chitable

Age,18,19,20,21,22,23,24,25,26,27,...,51,52,53,54,55,56,57,58,59,60
Attrition,,,,,,,,,,,,,,,,,,,,,
No,12,9,15,21,33,30,57,60,81,135,...,51,45,51,54,57,33,12,27,30,15
Yes,12,18,18,18,15,12,21,18,36,9,...,6,9,6,0,9,9,0,15,0,0

In [37]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(357.52484648609584, 1.1886524349105674e-51)

In [39]:
chitable = pd.crosstab(data.Attrition,data.BusinessTravel) 
chitable

BusinessTravel  Non-Travel  Travel_Frequently  Travel_Rarely
Attrition
No                     414                624           2661
Yes                     36                207            468

In [40]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(72.54724105696552, 1.764276972983189e-16)

In [42]:
chitable = pd.crosstab(data.Attrition,data.Department) 
chitable

Department  Human Resources  Research & Development  Sales
Attrition
No                      132                    2430   1137
Yes                      57                     453    201

In [43]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(29.090274924488266, 4.820888218170406e-07)

In [44]:
chitable = pd.crosstab(data.Attrition,data.DistanceFromHome) 
chitable

DistanceFromHome,1,2,3,4,5,6,7,8,9,10,...,20,21,22,23,24,25,26,27,28,29
Attrition,,,,,,,,,,,,,,,,,,,,,
No,528,519,222,159,165,156,204,207,219,198,...,66,48,48,69,75,69,72,27,57,69
Yes,96,114,30,33,30,21,48,33,36,60,...,9,6,9,12,9,6,3,9,12,12

In [45]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(102.3516705172535, 2.098176387479194e-10)

In [49]:
chitable = pd.crosstab(data.Attrition,data.Education) 
chitable

Education    1    2     3     4    5
Attrition
No         432  687  1449  1008  123
Yes         78  159   267   186   21

In [50]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(5.6411476792491975, 0.22759826301782404)

In [51]:
chitable = pd.crosstab(data.Attrition,data.EducationField) 
chitable

EducationField,Human Resources,Life Sciences,Marketing,Medical,Other,Technical Degree
Attrition,,,,,,
No,48,1515,402,1167,216,351
Yes,33,303,75,225,30,45

In [52]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(46.194921001730584, 8.288917469574179e-09)

In [53]:
chitable = pd.crosstab(data.Attrition,data.EmployeeCount) 
chitable

EmployeeCount     1
Attrition
No             3699
Yes             711

In [54]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(0.0, 1.0)

In [55]:
chitable = pd.crosstab(data.Attrition,data.EmployeeID) 
chitable

EmployeeID,1,2,3,4,5,6,7,8,9,10,...,4401,4402,4403,4404,4405,4406,4407,4408,4409,4410
Attrition,,,,,,,,,,,,,,,,,,,,,
No,1,0,1,1,1,1,0,1,1,1,...,1,1,0,1,1,1,1,1,1,1
Yes,0,1,0,0,0,0,1,0,0,0,...,0,0,1,0,0,0,0,0,0,0

In [56]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(4410.0, 0.4929200549833833)

In [57]:
chitable = pd.crosstab(data.Attrition,data.Gender) 
chitable

Gender     Female  Male
Attrition
No           1494  2205
Yes           270   441

In [58]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(1.349904410246582, 0.24529482862926827)

In [59]:
chitable = pd.crosstab(data.Attrition,data.JobLevel) 
chitable

JobLevel      1     2    3    4    5
Attrition
No         1377  1317  558  267  180
Yes         252   285   96   51   27

In [60]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(6.2691759264759925, 0.1799276801337184)

In [61]:
chitable = pd.crosstab(data.Attrition,data.JobRole) 
chitable

JobRole,Healthcare Representative,Human Resources,Laboratory Technician,Manager,Manufacturing Director,Research Director,Research Scientist,Sales Executive,Sales Representative
Attrition,,,,,,,,,
No,336,135,651,264,387,183,717,813,213
Yes,57,21,126,42,48,57,159,165,36

In [62]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(25.116313674604072, 0.001485544744815264)

In [63]:
chitable = pd.crosstab(data.Attrition,data.MaritalStatus) 
chitable

MaritalStatus  Divorced  Married  Single
Attrition
No                  882     1767    1050
Yes                  99      252     360

In [64]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(138.49102962254608, 8.45385940605786e-31)

In [65]:
chitable = pd.crosstab(data.Attrition,data.MonthlyIncome) 
chitable

MonthlyIncome,10090,10510,10520,10810,10910,11020,11180,11290,12000,12230,...,197170,197400,198330,198450,198470,198590,199260,199430,199730,199990
Attrition,,,,,,,,,,,,,,,,,,,,,
No,0,3,3,3,3,3,3,0,3,3,...,3,3,3,3,3,0,3,3,3,3
Yes,3,0,0,0,0,0,0,3,0,0,...,0,0,0,0,0,3,0,0,0,0

In [66]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(4031.019279928548, 8.232120330919514e-265)

In [67]:
chitable = pd.crosstab(data.Attrition,data.NumCompaniesWorked) 
chitable

NumCompaniesWorked  0.0   1.0  2.0  3.0  4.0  5.0  6.0  7.0  8.0  9.0
Attrition
No                  517  1265  390  426  365  141  160  171  129  120
Yes                  69   293   48   48   50   46   48   51   18   36

In [68]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(75.19096213171483, 1.4488734771666454e-12)

In [69]:
chitable = pd.crosstab(data.Attrition,data.Over18) 
chitable

Over18        Y
Attrition
No         3699
Yes         711

In [70]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(0.0, 1.0)

In [71]:
chitable = pd.crosstab(data.Attrition,data.PercentSalaryHike) 
chitable

PercentSalaryHike,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25
Attrition,,,,,,,,,,,,,,,
No,540,504,525,516,240,204,201,228,186,138,117,138,69,54,39
Yes,90,90,102,87,63,30,45,39,42,27,27,30,15,9,15

In [72]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(19.134303440424052, 0.15988066739973142)

In [73]:
chitable = pd.crosstab(data.Attrition,data.StandardHours) 
chitable

StandardHours     8
Attrition
No             3699
Yes             711

In [74]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(0.0, 1.0)

In [75]:
chitable = pd.crosstab(data.Attrition,data.StockOptionLevel) 
chitable

StockOptionLevel     0     1    2    3
Attrition
No                1575  1518  390  216
Yes                318   270   84   39

In [76]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(3.046265305068262, 0.38454683657380506)

In [77]:
chitable = pd.crosstab(data.Attrition,data.TotalWorkingYears) 
chitable

TotalWorkingYears,0.0,1.0,2.0,3.0,4.0,5.0,6.0,7.0,8.0,9.0,...,30.0,31.0,32.0,33.0,34.0,35.0,36.0,37.0,38.0,40.0
Attrition,,,,,,,,,,,,,,,,,,,,,
No,18,123,66,99,153,216,309,189,260,257,...,21,24,27,18,12,9,18,12,3,0
Yes,15,119,27,27,36,48,66,54,47,30,...,0,3,0,3,3,0,0,0,0,6

In [78]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(363.61615248162457, 2.805736076909354e-54)

In [79]:
chitable = pd.crosstab(data.Attrition,data.TrainingTimesLastYear) 
chitable

TrainingTimesLastYear    0    1     2     3    4    5    6
Attrition
No                     132  183  1359  1215  321  306  183
Yes                     30   30   282   258   48   51   12

In [80]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(22.690612849829215, 0.0009070057637258118)

In [81]:
chitable = pd.crosstab(data.Attrition,data.YearsAtCompany) 
chitable

YearsAtCompany,0,1,2,3,4,5,6,7,8,9,...,27,29,30,31,32,33,34,36,37,40
Attrition,,,,,,,,,,,,,,,,,,,,,
No,84,336,300,324,273,525,201,237,213,222,...,6,6,3,6,6,12,3,6,3,0
Yes,48,177,81,60,57,63,27,33,27,24,...,0,0,0,3,3,3,0,0,0,3

In [82]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(286.16626478262043, 1.0190499837423921e-40)

In [83]:
chitable = pd.crosstab(data.Attrition,data.YearsSinceLastPromotion) 
chitable

YearsSinceLastPromotion,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
Attrition,,,,,,,,,,,,,,,,
No,1413,924,396,129,168,129,78,180,54,39,15,66,30,24,24,30
Yes,330,147,81,27,15,6,18,48,0,12,3,6,0,6,3,9

In [84]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(65.53490981436207, 2.7530023754864334e-08)

In [85]:
chitable = pd.crosstab(data.Attrition,data.YearsWithCurrManager) 
chitable

YearsWithCurrManager,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17
Attrition,,,,,,,,,,,,,,,,,,
No,534,195,882,369,261,81,75,555,291,174,72,63,54,42,9,15,6,21
Yes,255,33,150,57,33,12,12,93,30,18,9,3,0,0,6,0,0,0

In [87]:
stats,p,dof,expected = chi2_contingency(chitable)
stats,p

(223.8515523457968, 4.37385677465416e-38)

# RESULT:
## case1:

##### h0: there is no significant difference between attrition and Age, BusinessTravel,Department,DistanceFromHome,EducationField,JobRole,MaritalStatus,MonthlyIncome,NumCompaniesWorked,TotalWorkingYears', 'TrainingTimesLastYear,YearsAtCompany, YearsSinceLastPromotion, YearsWithCurrManager
##### h1: there is significant difference between attrition and Age, BusinessTravel,Department,DistanceFromHome,EducationField,JobRole,MaritalStatus,MonthlyIncome,NumCompaniesWorked,TotalWorkingYears, TrainingTimesLastYear,YearsAtCompany, YearsSinceLastPromotion, YearsWithCurrManager
Here , p_value < 0.05 
#### Hence, h0 is rejected and h1 is accepted.
#### which means, there is significant difference between attrition and Age, BusinessTravel,Department,DistanceFromHome,EducationField,JobRole,MaritalStatus,MonthlyIncome,NumCompaniesWorked,TotalWorkingYears', 'TrainingTimesLastYear,YearsAtCompany, YearsSinceLastPromotion, YearsWithCurrManager

## case2:

##### h0: there is no significant difference between attrition and  Education,EmployeeCount,EmployeeID,Gender,JobLevel,Over18,PercentSalaryHike,StandardHours,StockOptionLevel.
##### h1: there is significant difference between attrition and Education,EmployeeCount,EmployeeID,Gender,JobLevel,Over18,PercentSalaryHike,StandardHours,StockOptionLevel.
Here , p_value > 0.05 
#### Hence, h0 is rejected and h1 is accepted.
#### which means, there is significant difference between attrition and  Education,EmployeeCount,EmployeeID,Gender,JobLevel,Over18,PercentSalaryHike,StandardHours,StockOptionLevel.